Revit.Elements.Views.AreaPlanView
A Revit Area Plan View

Revit.Elements.Views.AreaPlanView.#ctor(Autodesk.Revit.DB.ViewPlan)
Private constructor

Revit.Elements.Views.AreaPlanView.#ctor(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.AreaScheme)
Private constructor

Revit.Elements.Views.AreaPlanView.InitAreaPlanView(Autodesk.Revit.DB.ViewPlan)
Initialize a AreaPlanView element

Revit.Elements.Views.AreaPlanView.InitAreaPlanView(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.AreaScheme)
Initialize a AreaPlanView element

Revit.Elements.Views.AreaPlanView.ByLevelAndAreaScheme(Revit.Elements.Level,Revit.Elements.Element)
Create an Area Plan View at the given Level.
level: The Level on which the AreaPlanView is based.
areaScheme: Area Scheme to be applied to plan view.
Returns: An Area Plan View if successful.

Revit.Elements.Views.AreaPlanView.FromExisting(Autodesk.Revit.DB.ViewPlan,System.Boolean)
Create from existing Element
plan: Area Plan View.
isRevitOwned: Is Revit Owned?
Returns: